<a href="https://colab.research.google.com/github/Datriks/Python_Repo/blob/master/3_Intermediate_Excel_functions_in_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

3 Intermediate Excel functions and how to do them in Python

In [1]:
import pandas as pd

df2 = pd.DataFrame({'Postal Code':['M1R0E9','VOS1G2','A1SB1G'],
                    'Name':['Nik','Mel','Jane']})
print(df2)

  Postal Code  Name
0      M1R0E9   Nik
1      VOS1G2   Mel
2      A1SB1G  Jane

### Apply few of the text functions

In [3]:
df2['Left'] = df2['Postal Code'].str[:3]
print(df2)

  Postal Code  Name Left
0      M1R0E9   Nik  M1R
1      VOS1G2   Mel  VOS
2      A1SB1G  Jane  A1S

In [5]:
df2['Right'] = df2['Postal Code'].str[-3:]
df2

  Postal Code  Name Left Right
0      M1R0E9   Nik  M1R   0E9
1      VOS1G2   Mel  VOS   1G2
2      A1SB1G  Jane  A1S   B1G

In [7]:
df2['Lower'] = df2['Name'].str.lower()
df2

  Postal Code  Name Left Right Lower
0      M1R0E9   Nik  M1R   0E9   nik
1      VOS1G2   Mel  VOS   1G2   mel
2      A1SB1G  Jane  A1S   B1G  jane

In [9]:
df2['Upper'] = df2['Name'].str.upper()
df2

  Postal Code  Name Left Right Lower Upper
0      M1R0E9   Nik  M1R   0E9   nik   NIK
1      VOS1G2   Mel  VOS   1G2   mel   MEL
2      A1SB1G  Jane  A1S   B1G  jane  JANE